import json
import os

PERSONEL_LIST_FILE_NAME_OLD = os.path.join("resources", "СТАРИЙ_СПИСОК.xlsx")
PERSONEL_LIST_FILE_NAME_NEW = os.path.join("resources", "НОВИЙ_СПИСОК.xlsx")

DATA_FILE_NAME = os.path.join("resources", "data.json")
with open(DATA_FILE_NAME, encoding="utf-8") as _data_file:
    _DATA = json.load(_data_file)
_unit = _DATA["unit"]
PERSONEL_LIST_SHEET_NAME = _unit["PERSONEL_LIST_SHEET_NAME"]
FULL_MILITARY_UNIT = _unit["FULL_MILITARY_UNIT"]

# Колонки для файлу "СТАРИЙ_СПИСОК.xlsx", а саме: підрозділ повністю, номер посади, Посада, ВОС, звання за штатом, звання фактичне, ПІБ
PERSONEL_LIST_COLUMNS_LETTERS_OLD = ['F', 'J', 'K', 'M', 'N', 'O', 'P']

# Колонки для файлу "НОВИЙ_СПИСОК.xlsx", а саме:  повністю підрозділ, номер посади, Посада, ВОС, звання за штатом, звання фактичне, ПІБ
PERSONEL_LIST_COLUMNS_LETTERS_NEW = ['P', 'Q', 'R', 'T', 'U', 'V', 'W']

TRANSFER_LIST_FILE_NAME = "mass_movement.xlsx"
TRANSFER_LIST_SHEET_NAME = 'Аркуш1'
# Колонки для файлу "mass_movement.xlsx", а саме: НОМЕР ПОСАДИ З ЯКОЇ ПЕРЕМІЩУЄТЬСЯ ОСОБА,	НОМЕР ПОСАДИ НА ЯКУ ПЕРЕМІЩУЄТЬСЯ ОСОБА, КОМАНДИР В СТАРІЙ ШТАТІ ЯКИЙ КЛОПОЧЕ КОМАНДИРУ БАТАЛЬЙОНУ,	КОМАНДИР В НОВОМУ ШТАТІ ЯКИЙ КЛОПОЧЕ КОМАНДИРУ БАТАЛЬЙОНУ, КОМАНДИР БАТАЛЬЙОНУ В СТАРІЙ ШТАТІ, КОМАНДИР БАТАЛЬЙОНУ В НОВОМУ ШТАТІ
TRANSFER_LIST_FILE_COLUMNS_LETTERS = ['A', 'B', 'C', 'D', 'E', 'F']

TASK_LIST_FILE_NAME = os.path.join("resources", "ЗАДАЧІ.xlsm")
TASK_LIST_SHEET_NAME = 'Аркуш1'
TVO_LIST_SHEET_NAME = 'Аркуш2'
# Колонки для файлу "ЗАДАЧІ.xlsm", а саме: Посада називний,	посада називний, ПІБ називний, Посада родовий, посада родовий, ПІБ родовий, Посада давальний, посада давальний, ПІБ давальний
TASK_LIST_FILE_COLUMNS_LETTERS = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I']
# Колонки для файлу "ЗАДАЧІ.xlsm", а саме: Підрозділ, ПОСАДА, Start, End, ЗВАННЯ, ПІБ, ТВО, №old, №new, old TVO Active, new TVO Active
TVO_LIST_COLUMNS_LETTERS = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K']

OUTPUT_DIR = 'output'

# Відмінки для звання
RANKS = {
    "підполковник": "підполковника",
    "майор": "майора",
    "капітан": "капітана",
    "лейтенант": "лейтенанта",
    "старший лейтенант": "старшого лейтенанта",
    "молодший лейтенант": "молодшого лейтенанта",
    "сержант": "сержанта",
    "старший сержант": "старшого сержанта",
    "молодший сержант": "молодшого сержанта",
    "майстер-сержант": "майстер-сержанта",
    "штаб-сержант": "штаб-сержанта",
    "матрос": "матроса",
    "старший матрос": "старшого матроса",
    "головний сержант": "головного сержанта",
    "старший лейтенант медичної служби": "старшого лейтенанта медичної служби"
}

COMMANDER_POSITIONS = {
    "Командир взводу": {
        "родовий": "Командира взводу",
        "давальний": "Командиру взводу"
    },
    "Командир роти": {
        "родовий": "Командира роти",
        "давальний": "Командиру роти"
    },
    "Командир батареї": {
        "родовий": "Командира батареї",
        "давальний": "Командиру батареї"
    },
    "Начальник медичного пункту": {
        "родовий": "Начальника медичного пункту",
        "давальний": "Начальнику медичного пункту"
    },
    "Командир батальйону": {
        "родовий": "Командира батальйону",
        "давальний": "Командиру батальйону"
    },
    "Начальник штабу-заступник командира батальйону": {
        "родовий": "Начальника штабу-заступника командира батальйону",
        "давальний": "Начальнику штабу-заступнику командира батальйону"
    }
}